'''Внесите 12 правок в свой код, в которых улучшите работу с константами, 
и напишите по каждой, что конкретно вы улучшили.'''


month - MONTH_IN_A_YEAR #количество месяцев в году
quarters - QUARTERS_IN_A_YEAR #количество кварталов в году
project - PROJECT_NAME # наименование проекта
usd - USD_RATE # курс доллара на день расчета
eur - EURO_RATE # курс евро на день расчета
div - DIVISION_NAME # наименование подразделения
r - DISCOUNT_RATE # принятая в компании ставка дисконтирования
period - PROJECT_PERIOD # горизонт планирования проекта
start - MONTH_OF_PROJECT_START # месяц начала проекта
pp - TARGET_PAYBACK_PERIOD # целевое значение периода окупаемости проекта
dpp - TARGET_DISCOUNT _PP # целевое значение дисконтированного периода окупаемости проекта
pi - TARGET_PI # целевое значение индекса прибыльности