'''Пересмотреть свои предыдущие решения и найти 12 примеров имён переменных (не функций/методов),
которые были плохими, и которые можно улучшить.
Формат: было - стало // комментарий к контексту'''

name - card_name // имя карточки игрока
result - list_of_player_card_values // список значений карточки игрока
result2 - list_card_values_in_final_form // список значений карточки в итоговом виде, разбита на 3 строки
finish - counting_number_of_player_moves // подсчёт числа ходов игрока
count - value_of_player_score // значение счета игрока
k - element_index // индекс элемента списка значений
el - element_value // значение элемента списка значений
n - number_of_matches_player_card // количество совпадений введенного ответа с элементами значений карточки игрока
n1 - number_of_matches_computer_card // количество совпадений введенного ответа с элементами значений карточки компьютера
number1 - randomly_selected_number // случайно выбранное число в заданном диапазоне
number2 - answer_value // введенное значение ответа
max = maximum_of_possible_randomly_number // максимум из возможного случайно выбранного числа
memory_nym - list_of_answers_history // список данных ранее ответов, которые не должны повторяться