'''6.1. Разберите свой код, и сделайте пять примеров, где можно более наглядно
учесть в именах переменных уровни абстракции.'''
circles - circles_of_matrix // список списков значений кругов матрицы
circle_i - list_matrix_circle // список значений круга матрицы, если представить матрицу в виде кругов
circle_quantity - quantity_circles // количество кругов в матрице
my_sum - toner_consumption // расход тонера
circles_list - circles_turn_matrix // список списков значений кругов матрицы после поворота
'''6.2. Приведите четыре примера, где вы в качестве имён переменных использовали 
или могли бы использовать технические термины из информатики.'''
id_
distr_id
client_id
partner_department
reporting_date
creation_date
unit_name
discount
'''6.3. Придумайте или найдите в своём коде три примера, когда имена 
переменных даны с учётом контекста (функции, метода, класса).'''
left_edge // левый край круга матрицы в методе обработки кругов матрицы
len_edge // длина края круга матрицы в методе обработки кругов матрицы
last_node // последний узел в методе удаления узлов связанного списка
'''6.4. Найдите пять имён переменных в своём коде, длины которых 
не в 8-20 символов, и исправьте, чтобы они укладывались в данный диапазон.'''

list_of_player_card_values - player_card_values // список значений карточки игрока
list_card_values_in_final_form - card_final_values // список значений карточки в итоговом виде, разбита на 3 строки
counting_number_of_player_moves - number_player_moves // подсчёт числа ходов игрока
number_of_matches_player_card - quant_matches_play// количество совпадений введенного ответа с элементами значений карточки игрока
number_of_matches_computer_card - quant_matches_comp// количество совпадений введенного ответа с элементами значений карточки компьютера
randomly_selected_number - random_number// случайно выбранное число в заданном диапазоне
maximum_of_possible_randomly_number - max_random_number// максимум из возможного случайно выбранного числа

