'''7.1. Приведите пять примеров правильного именования булевых 
переменных в вашем коде в формате "было - стало".'''

leap - is_leap
nn - done
x - is_in_list
flag - is_in_list
flag - number_is_four

'''7.2. Найдите несколько подходящих случаев, когда в вашем коде можно 
использовать типичные имена булевых переменных.'''

def is_leap(year):
    success = False
    # ...
        
def my_num(self):#Генерим новый бочонок
    done = False
    while done == False:
    # ...

'''7.3. Проверьте, правильно ли вы даёте имена индексам циклов. 
Попробуйте найти случай, когда вместо i j k нагляднее использовать 
более выразительное имя.'''

for index_element, value_element in enumerate(str_comlex_number):


'''7.4. Попробуйте найти в своих решениях два-три случая, 
когда можно использовать пары имён - антонимы.'''

first_name / last_name
found / lost

'''7.5. Всем ли временным переменным в вашем коде присвоены 
выразительные имена? Найдите несколько случаев, когда временные 
переменные надо переименовать, и поищите, возможно, от некоторых 
временных переменных вам получится вообще полностью избавиться.'''


list0 - task_list
n - counter



